#list = ['','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','']
def 三年级下册():
    list1 = ['懂得','奇妙','博大','精彩','寄托','关爱','期盼','滋润','幼小','喜欢','看望','问候','收藏','确实','美好','跌落','孤苦无缘','逼近','猛扑','救护','躯体','颤抖','牺牲','承认','恭敬','听写完毕']
    list2 = ['理想','翅膀','飘带','似乎','偏偏起舞','巧手','未来','棒','后脑勺','竭力','渴望','沙哑','善良','发誓','飘洒','疲劳','绵绵','朦胧','消融','听写完毕']
    list3 = ['洒落','通体','迅速','追逐','立即','舞动','猛烈','讨人喜欢','敏捷','玲珑','机灵','嬉戏','摇晃','听写完毕']
    list4 = ['游泳','省略号','年轮','发现','嵌','妙不可言','思考','救死扶伤','解除','志愿','鄙视','留心','记载','完善','积累','严寒酷署','品尝','访问','浓厚','无限','小心翼翼','欣赏','训斥','迷恋','强烈','听写完毕']
    list5 = ['浩瀚','漫游','尊敬','沐浴','沉思','幻想','命运','忧伤','愉悦','充实','挖掘','拥抱','笼罩','清辉','埋藏','钥匙','智慧','面貌','辛勤','启程','黎明','环境','顽强','艰苦','振奋人心','恨不得','完整无缺','叨念','激励','听写完毕']
    #list6 = ['','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','','']
    list7 = ['亮晶晶','颜色','漆黑','花冠','漂亮','深浅','元帅','规矩','著名','将领','职务','模样','搞鬼','接待','听写完毕']
    list8 = ['泛滥','逃荒','堵塞','叮嘱','开凿','长年','欣欣向荣','敬仰','爱戴','英雄','攻击','瞭望','苍白','煞白','惨白','服从','瞄准','喝彩','原谅','低沉','财产','听写完毕']
    list9 = ['垂头丧气','疑惑','胸有成竹','得意洋洋','讥讽','轻蔑','目瞪口呆','调换','顺序','转败为胜','浮','议论纷纷','熟悉','沉没','搭','拴','绑','绷','拔','拖','出色','工程','风平浪静','哭笑不得','失足','不知所措','呜咽','听写完毕']
    list10 = ['嫩绿','融化','散步','严实','视线','乳白','利剑','盛开','苍翠','酸甜可口','名贵','诱人','宝库','富饶','嘱咐','危害','劝阻','浑浊不堪','洗劫','悲惨','横行','调节','干燥','联合','席卷','逼近','无隐无踪','听写完毕']

    dict1 = {
            '亲情': list1,
             '春天的脚步': list2,
             '可爱的小生灵':list3,
             '观察与发现':list4,
             '读书':list5,
             #'特产':list6,
             '尊重与平等':list7,
             '选择':list8,
             '智慧':list9,
             '走进森林':list10
            }
    return dict1