#【day】基本功能介绍
#复原基本功能
#   Alt+w -> k -> r
#新建画布
#   ctrl+n
#宽度高度
#   海报
#       21，29.7，厘米
#   网页banner
#       1000,450，像素
#分辨率
#   海报：300
#   横幅：200、150
#   网页：72、96
#颜色模式
#   需要印刷
#       CMYK
#   不需要印刷
#       RGB
#   黑白色
#       灰度
#背景内容
#   默认颜色：白黑
#   背景色：画板背景色
#填充背景颜色
#   填充前景色
#       alt+del
#   填充背景色
#       ctrl+del
#切换前背景色
#   x
#复原默认前背景色
#   d
#显示/隐藏通用面板
#   shift+tab
#显示/隐藏工具+通用面板
#   tab
#缩放工具
#   z
#首选项
#   ctrl+k
#       改变参考线颜色
#           参考线与网格切片
#
#抓手工具
#   h
#   空格
#       右键缩放
#           按屏幕大小缩放
#               ctrl+0
#           打印尺寸
#关闭浮动窗口
#   ctrl+w
#关闭全部浮动窗口
#   ctrl+alt+w
#打开图片
#   拉到空工作区
#       打开图片
#   拉到已经打开的图片
#       增加图层
#   拉到浮动窗口栏
#       打开图片
#排列图片
#   窗口 -> 排列 -> 双联水平
#文字工具
#   t
#   确定文字格式
#       ctrl+enter
#保存
#   ctrl+s
#另存为
#   ctrl+shift+s
#       .psd
#           源图片
#       .jpeg
#           小图片
#       .tiff
#           大图片
#       .png
#           透明图片
#删除背景色
#   点击图层锁
#   拖拽图层到下方垃圾桶
#新建图层
#   弹出图层属性窗口添加
#       ctrl+shift+n
#   不弹出图层属性窗口添加
#       ctrl+alt+shift+n
#选框工具
#   m
#   以鼠标为中心画
#       shift+alt
#   以对角线为参考
#       shift
#   选择固定大小的选框区域
#       属性栏
#           样式
#               固定大小
#                   宽度
#                       右键可选择单位
#                   高度
#                       右键可选择单位
#   移动图层中的选区区域
#       m之后再移动
#取消选区
#   ctrl+d
#切换工具组中的选项，即多种工具共用一个快捷键
#   切换椭圆/矩形选框工具
#       shift+m
#移动工具
#   v
#   复制图形图层
#       alt+移动
#改变图像模式
#   灰度
#       atl+i -> m -> g
#   rgb
#       atl+i -> m -> r
#删除图层被选中区域
#   del
#自由变换
#   ctrl+t
#       旋转角度
#           鼠标移动至矩形框四角
#       确定形状
#           ctrl+enter
#       以中心等比例缩放
#           alt
#       以中心自由比例缩放
#           shift+alt
#       以左顶点为中心自由比例缩放
#           shift
#       以左顶点为中心等比例缩放
#           不按任何键
#       移动中心点
#隐藏/显示标尺
#   ctrl+r
#参考线
#   新建参考线
#       用移动工具在标尺中拖出
#       alt+v+e
#           水平
#               500像素
#           垂直
#               500像素
#   显示/隐藏
#       ctrl+;
#   锁定/解锁参考线
#       ctrl+alt+;
#   删除参考线
#       清除全部参考线
#           alt+v+d
#       拖动删除参考线
#           直接将参考线拖出标尺范围外
#智能参考线
#   ctrl+v+h+m
#网格
#   ctrl+'
#合并图层
#   ctrl+e
#复制自由变换
#   ctrl+alt+t
#       右键菜单
#           水平翻转
#           垂直翻转
#粘贴自由变换
#   ctrl+alt+shift+t