#【day】淘宝店铺注册
#账号：父爱如山jjkk
#密码：135cylpsx
#电话：18080908563

#千牛安装

#正常的退货流程是
#    顾客申请退货----看到默认退货地址无法退货----根据提示来联系我们要退货地址----我们去上家那申请退货并索要退货地址----把上家的退货地址告诉给我们的顾客。

#我们开通商家运费险服务有哪些好处？
#    1.运费险的全称为退货运费险，当发生退货时，卖家同意退货申请，达成退货协议，买家填写退货时物流信息，等交易结束后72小时内，保险公司将按约定对买家的退货运费进行赔付。
#    2.顾客在咨询我们产品质量问题的过程中，我们可以告诉顾客，我们店铺里的宝贝都购买了运费险的，不管什么原因退货的话，退完货淘宝都会补偿一笔运费给你。这样可以大大提高我们的转化率！
#    3.当产品因为质量问题买家申请退货，他们会要求我们承担运费，这个时候我们可以告诉他，我们是有运费险的，完成退货流程之后，淘宝会补偿一笔运费。
#    4.购买过运费险的店铺里的宝贝会有一个运费险的标识，很多顾客看到有这个运费险标识会比较放心购买我们的东西。
#    特别说明：我们建议大家开通运费险，明显是利大于弊的！但是购买运费险的费用需要大家自行承担，如果你很在意这几毛钱，请你不要开通运费险服务！