#【day】基本功能介绍
#复原基本功能
#   Alt+w -> k -> r
#新建画布
#   ctrl+n
#宽度高度
#   海报
#       21，29.7，厘米
#   网页banner
#       1000,450，像素
#分辨率
#   海报：300
#   横幅：200、150
#   网页：72、96
#颜色模式
#   需要印刷
#       CMYK
#   不需要印刷
#       RGB
#   黑白色
#       灰度
#背景内容
#   默认颜色：白黑
#   背景色：画板背景色
#填充背景颜色
#   填充前景色
#       alt+del
#   填充背景色
#       ctrl+del
#切换前背景色
#   x
#复原默认前背景色
#   d
#显示/隐藏通用面板
#   shift+tab
#显示/隐藏工具+通用面板
#   tab
#缩放工具
#   z
#首选项
#   ctrl+k
#       参考线与网格切片
#           改变参考线颜色
#       性能
#           历史记录状态
#               设置历史记录最大记录步数
#       暂存盘
#           当磁盘空间不够用，会提示无法暂存历史记录
#               可以勾选增加暂存盘
#中心参考线
#   选中背景图层
#       ctrl+a
#       ctrl+左键拖拽
#抓手工具
#   h
#   空格
#       右键缩放
#           按屏幕大小缩放
#               ctrl+0
#           打印尺寸
#关闭浮动窗口
#   ctrl+w
#关闭全部浮动窗口
#   ctrl+alt+w
#打开图片
#   拉到空工作区
#       打开图片
#   拉到已经打开的图片
#       增加图层
#   拉到浮动窗口栏
#       打开图片
#排列图片
#   窗口 -> 排列 -> 双联水平
#文字工具
#   t
#   确定文字格式
#       ctrl+enter
#保存
#   ctrl+s
#另存为
#   ctrl+shift+s
#       .psd
#           源图片
#       .jpeg
#           小图片
#       .tiff
#           大图片
#       .png
#           透明图片
#删除背景色
#   点击图层锁
#   拖拽图层到下方垃圾桶
#新建图层
#   弹出图层属性窗口添加
#       ctrl+shift+n
#   不弹出图层属性窗口添加
#       ctrl+alt+shift+n
#选框工具
#   m
#   以鼠标为中心画
#       shift+alt
#   以对角线为参考
#       shift
#   选择固定大小的选框区域
#       属性栏
#           样式
#               固定大小
#                   宽度
#                       右键可选择单位
#                   高度
#                       右键可选择单位
#   移动图层中的选区区域
#       m之后再移动
#   以参考线焦点为中心，垂直水平方向复制选框
#       alt+鼠标左键拖动
#   加选选区
#       shift
#   减选选区
#       alt
#   交叉选区
#       shift+alt
#取消选区
#   ctrl+d
#切换工具组中的选项，即多种工具共用一个快捷键
#   切换椭圆/矩形选框工具
#       shift+m
#移动工具
#   v
#   复制图形图层
#       alt+移动
#   属性
#       组
#       图层
#       对齐方式
#           左对齐
#           居中对齐
#           右对齐
#           顶对齐
#           垂直居中对齐
#           底对齐
#       分布方式
#           顶分布
#           垂直居中分布
#           底分布
#           左分布
#           水平居中分布
#           右分布
#改变图像模式
#   灰度
#       atl+i -> m -> g
#   rgb
#       atl+i -> m -> r
#删除图层被选中区域
#   del
#自由变换
#   ctrl+t
#       旋转角度
#           鼠标移动至矩形框四角
#       确定形状
#           ctrl+enter
#       以中心等比例缩放
#           alt
#       以中心自由比例缩放
#           shift+alt
#       以左顶点为中心自由比例缩放
#           shift
#       以左顶点为中心等比例缩放
#           不按任何键
#       移动中心点
#       透视
#           ctrl+alt+左键拖拉角
#隐藏/显示标尺
#   ctrl+r
#参考线
#   新建参考线
#       用移动工具在标尺中拖出
#       alt+v+e
#           水平
#               500像素
#           垂直
#               500像素
#   显示/隐藏
#       ctrl+;
#   锁定/解锁参考线
#       ctrl+alt+;
#   删除参考线
#       清除全部参考线
#           alt+v+d
#       拖动删除参考线
#           直接将参考线拖出标尺范围外
#智能参考线
#   ctrl+v+h+m
#网格
#   ctrl+'
#合并图层
#   ctrl+e
#复制自由变换
#   ctrl+alt+t
#       右键菜单
#           水平翻转
#           垂直翻转
#粘贴自由变换
#   ctrl+alt+shift+t
#吸管工具
#   i
#油桶工具
#   g
#套索工具组
#   l
#   属性
#       添加到选区
#           在一个选区的基础上曾加一个选区，取并集
#   多边形套索
#       删除一个节点
#           del
#   磁性套索
#       属性
#           频率
#               自动绘制节点的频率
#
#选择图像缩览图区域
#   ctrl+点击图层中的缩览图
#选区扩展(前提是有选区)
#   alt+s+m+e
#选区收缩
#   alt+s+m+c
#   说明：收缩的值不能太大，否则正圆会出现棱角
#选区平滑（矩形角画圆）
#   alt+s+m+s
#羽化选区
#   shift+F6
#   注意：如果需要修改羽化值，需要后退到第一次设置羽化值之前的步骤
#图层移动
#   上移一层
#       ctrl+]
#   下移一层
#       ctrl+[
#   移至顶层
#       shift+ctrl+]
#   移至低层
#       shift+ctrl+[
#历史记录
#   窗口+历史记录
#图层组管理
#   选中需要管理的图层 --> ctrl+g
#删除组管理
#   选中需要删除的组 --> shift+ctrl+g
#图层链接
#   选中需要链接的图层 --> 点击链接按钮
#删除图层链接
#   选中任一被链接的图层 --> 点击链接按钮
#图层属性
#   不透明度
#   填充
#   锁定全部
#       点击之后就不能改变图层图像的大小位置颜色透明度等，甚至不能删除
#图像大小
#   ctrl+alt+i
#投影制作
#   选区羽化
#   填充黑色
#橡皮擦
#   e
#   属性
#       大小
#           放大[
#           缩小]
#       硬度
#           加硬度shift+[
#           减硬度shift+]
#       光标
#           圆形光标
#               caps
#           十字光标
#               caps
#       不透明度
#           40%（脚阴影虚实关系）
#       流量
#           40%（脚阴影虚实关系）
#魔棒工具
#   w
#   属性
#       容差
#           容差越大选区范围越大（精度越模糊）
#           容差越小选区范围越小（精度越精准）
#       消除锯齿
#       连续
#快速选择工具
#   w
#   属性
#       新建选区
#       从选区增加
#       从选区减少
#       大小
#           增加[
#           减少]
#       硬度
#           增加shift+[
#           减少shift+]
#反选选区
#   ctrl+shift+i
#画笔工具
#   b
#   属性
#       大小
#       硬度
#   说明
#       颜色默认前景色
#渐变工具
#   g
#   属性
#       线性渐变
#           渐变编辑器
#               前景色到背景色
#               前景色到透明
#               黑到白
#               默认
#               实色
#               杂色
#       角度渐变
#           取消硬过渡
#               将起始颜色和结束颜色设置一致
#       对称渐变
#           拉一条对称线
#               在对称线的一侧使用对称渐变，另一边自动对称渐变
#色相饱和度
#   ctrl+u
#钢笔工具
#   p
#   属性
#       路径
#           用于抠图
#       形状
#           用于画图
#   shitf绘制
#       水平垂直45度角直线
#   钢笔线转选区
#       ctrl+enter
#   钢笔弧线
#       点左键不放找弧度
#   删除钢笔辅助线
#       alt+左键单击节点