#【day】creative cloud安装
#安装Creative_Cloud_Set-Up
#   账号：417217170@qq.com
#   密码：135CYLpsx4848@

#【day】photoshop基本功能介绍
#复原基本功能
#   Alt+w -> k -> r
#新建画布
#   ctrl+n
#   修改画布大小
#       ctrl+alt+c
#宽度高度
#   海报
#       21，29.7，厘米
#   网页banner
#       1000,450，像素
#分辨率
#   海报：300
#   横幅：200、150
#   网页：72、96
#颜色模式
#   需要印刷
#       CMYK
#   不需要印刷
#       RGB
#   黑白色
#       灰度
#背景内容
#   默认颜色：白黑
#   背景色：画板背景色
#填充背景颜色
#   填充前景色
#       alt+del
#   填充背景色
#       ctrl+del
#切换前背景色
#   x
#复原默认前背景色
#   d
#显示/隐藏通用面板
#   shift+tab
#显示/隐藏工具+通用面板
#   tab
#缩放工具
#   z
#首选项
#   ctrl+k
#       参考线与网格切片
#           改变参考线颜色
#       性能
#           历史记录状态
#               设置历史记录最大记录步数
#       暂存盘
#           当磁盘空间不够用，会提示无法暂存历史记录
#               可以勾选增加暂存盘
#中心参考线
#   选中背景图层
#       ctrl+a
#       ctrl+左键拖拽
#抓手工具
#   h
#   空格
#       右键缩放
#           按屏幕大小缩放
#               ctrl+0
#           打印尺寸
#关闭浮动窗口
#   ctrl+w
#关闭全部浮动窗口
#   ctrl+alt+w
#打开图片
#   拉到空工作区
#       打开图片
#   拉到已经打开的图片
#       增加图层
#   拉到浮动窗口栏
#       打开图片
#排列图片
#   窗口 -> 排列 -> 双联水平
#文字工具
#   t
#   确定文字格式
#       ctrl+enter
#保存
#   ctrl+s
#另存为
#   ctrl+shift+s
#       .psd
#           源图片
#       .jpeg
#           小图片
#       .tiff
#           大图片
#       .png
#           透明图片
#删除背景色
#   点击图层锁
#   拖拽图层到下方垃圾桶
#选框工具
#   m
#   以鼠标为中心画
#       shift+alt
#   以对角线为参考
#       shift
#   选择固定大小的选框区域
#       属性栏
#           样式
#               固定大小
#                   宽度
#                       右键可选择单位
#                   高度
#                       右键可选择单位
#   移动图层中的选区区域
#       m之后再移动
#   以参考线焦点为中心，垂直水平方向复制选框
#       alt+鼠标左键拖动
#   加选选区
#       shift
#   减选选区
#       alt
#   交叉选区
#       shift+alt
#取消选区
#   ctrl+d
#切换工具组中的选项，即多种工具共用一个快捷键
#   切换椭圆/矩形选框工具
#       shift+m
#移动工具
#   v
#   复制图形图层
#       alt+移动
#   属性
#       组
#       图层
#       对齐方式
#           左对齐
#           居中对齐
#           右对齐
#           顶对齐
#           垂直居中对齐
#           底对齐
#       分布方式
#           顶分布
#           垂直居中分布
#           底分布
#           左分布
#           水平居中分布
#           右分布
#改变图像模式
#   灰度
#       atl+i -> m -> g
#   rgb
#       atl+i -> m -> r
#删除图层被选中区域
#   del
#自由变换
#   ctrl+t
#       旋转角度
#           鼠标移动至矩形框四角
#       确定形状
#           ctrl+enter
#       以中心等比例缩放
#           alt
#       以中心自由比例缩放
#           shift+alt
#       以左顶点为中心自由比例缩放
#           shift
#       以左顶点为中心等比例缩放
#           不按任何键
#       移动中心点
#       透视
#           ctrl+alt+shift+左键拖拉角
#       斜切
#           ctrl
#隐藏/显示标尺
#   ctrl+r
#参考线
#   新建参考线
#       用移动工具在标尺中拖出
#       alt+v+e
#           水平
#               500像素
#           垂直
#               500像素
#   显示/隐藏
#       ctrl+;
#   锁定/解锁参考线
#       ctrl+alt+;
#   删除参考线
#       清除全部参考线
#           alt+v+d
#       拖动删除参考线
#           直接将参考线拖出标尺范围外
#智能参考线
#   ctrl+v+h+m
#网格
#   ctrl+'
#合并图层
#   ctrl+e
#合并到新图层
#   ctrl+alt+e
#合并图层不改变颜色
#   ctrl+alt+shift+e
#复制自由变换
#   ctrl+alt+t
#       右键菜单
#           水平翻转
#           垂直翻转
#   移动中心点
#       alt+左键
#粘贴自由变换
#   ctrl+alt+shift+t
#吸管工具
#   i
#油桶工具
#   g
#套索工具组
#   l
#   属性
#       添加到选区
#           在一个选区的基础上曾加一个选区，取并集
#   多边形套索
#       删除一个节点
#           del
#   磁性套索
#       属性
#           频率
#               自动绘制节点的频率
#
#选择图像缩览图区域
#   ctrl+点击图层中的缩览图
#选区扩展(前提是有选区)
#   alt+s+m+e
#选区收缩
#   alt+s+m+c
#   说明：收缩的值不能太大，否则正圆会出现棱角
#选区平滑（矩形角画圆）
#   alt+s+m+s
#   图片变圆角或照片变圆角
#       用矩形工具选取需要的部分
#           使用平滑修改四角的弧度
#               再反选
#                   双击图片图层解锁图层或栅格化图层
#                       del删除选中部分
#羽化选区
#   shift+F6
#   注意：如果需要修改羽化值，需要后退到第一次设置羽化值之前的步骤

#历史记录
#   窗口+历史记录
#图像大小
#   ctrl+alt+i
#投影制作
#   选区羽化
#   填充黑色
#橡皮擦
#   e
#   属性
#       画笔直径大小
#           放大[
#           缩小]
#       硬度
#           加硬度shift+[
#           减硬度shift+]
#       光标
#           圆形光标
#               caps
#           十字光标
#               caps
#       不透明度
#           40%（脚阴影虚实关系）
#       流量
#           40%（脚阴影虚实关系）
#魔棒工具
#   w
#   属性
#       容差
#           容差越大选区范围越大（精度越模糊）
#           容差越小选区范围越小（精度越精准）
#       消除锯齿
#       连续
#快速选择工具
#   w
#   属性
#       新建选区
#       从选区增加
#       从选区减少
#       大小
#           增加[
#           减少]
#       硬度
#           增加shift+[
#           减少shift+]
#反选选区
#   ctrl+shift+i
#画笔工具
#   b
#   属性
#       大小
#       硬度
#   说明
#       颜色默认前景色
#渐变工具
#   g
#   属性
#       线性渐变
#           渐变编辑器
#               前景色到背景色
#               前景色到透明
#               黑到白
#               默认
#               实色
#               杂色
#       角度渐变
#           取消硬过渡
#               将起始颜色和结束颜色设置一致
#       对称渐变
#           拉一条对称线
#               在对称线的一侧使用对称渐变，另一边自动对称渐变
#色相饱和度
#   ctrl+u
#钢笔工具
#   p
#   属性
#       路径
#           用于抠图
#       形状
#           用于画图
#   shitf绘制
#       水平垂直45度角直线和方向线
#   钢笔线转选区
#       ctrl+enter
#   钢笔弧线
#       点左键不放找弧度
#   删除钢笔方向线
#       alt+左键单击节点
#   调整节点和方向
#       ctrl+鼠标左键
#   保存路径
#       属性面板
#           路径
#               双击工作路径
#                   修改名字
#                       确定
#                       ctrl+s
#                           保存jpeg格式
#   第二次打开后重新载入路径
#       属性面板
#           路径
#               选中要重载的路径
#                   ctrl+enter
#   路径同图层类似，扣第二个路径也需要新建路径
#       创建新路径
#           点击创建新路径按钮
#           或在路径空白区域单击
#               再到图片中取扣图就会出现新的工作路径，双击后修改名字，保存新路径
#   转换点工具
#       修改形状的图形
#选区原位复制
#   ctrl+j
#文字工具
#   t
#   退出编辑模式
#       ctrl+enter
#   文字变形
#       无
#       扇形
#       ...
#文字图层转图像图层
#   右键点击文字图层空白区域
#       点击栅格化图层
#字符面板
#   ctrl+t
#   属性
#       切换文本取向
#   说明：在文字图层并且要在文字编辑模式
#   字体
#   大小
#   行间距
#       alt+上下方向键
#   字间距
#       alt+左右方向键
#   文本框区
#       多行文字的布局空间
#       ctrl+t+左键拖动
#   基线偏移
#       调整同行文字的横排上下对齐方式
#   加粗
#   倾斜
#   全部大写
#   上标
#   下标
#   下划线
#   删除线
#段落面板
#   对齐方式
#   避头尾法则设置
#       宽松
#       严格
#           开头是符号的就会移动到上一行末尾
#   左缩进
#   右缩进
#   首行缩进
#   段前添加空格
#       调整当前段落与上一段段落的距离
#   段后添加空格
#       调整当前段落与下一段段落的距离
#   说明：每个段落是单独对象，光标处即选择当前段落，可单独对其进行缩进操作
#编辑
#   定义图案
#       可以将自己绘制的图案保存下来用于载入其他图片
#   填充
#       shift+F5
#       内容
#           图案
#压边中高光帆布材质banner
#   背景高光填充
#   画笔深色大圈柔边画笔压边
#   填充自定义图案
#       4v4的白色对角线图案
#图像失真问题
#   在图片缩小后再放大就会失真
#       将图片转化为智能对象就不会出现这个问题了
#图形工具
#   矩形工具
#       u
#       以鼠标左键为中心画图
#           鼠标左键+alt+shift
#       属性窗口
#           填充
#               纯色
#               渐变
#                   前景色到背景色渐变
#                   增加渐变色点
#                       alt+左键
#               图案
#           描边
#               纯色
#               渐变
#               图案
#               粗细
#               样式
#                   虚线
#                       长短
#                       间距
#               内描
#               中描
#               外描
#       图形工具绘制的图形直接合并图层
#           不同颜色会变成相同色
#       合并两个不同颜色的形状对象图层
#           需要先栅格化再合并，否则颜色会变成一样
#           ctrl+alt+shift+e
#   圆角矩形工具
#       调整圆角的半径
#           属性窗口
#               鼠标左键拖动左上角半径（关联锁）
#   自定义图形工具
#       添加全部图形
#           $形状
#               $齿轮
#                   $全部
#   布尔运算
#       合并形状
#           shift+左键
#       减去顶层
#           alt+左键
#       排除重叠
#           shift+alt+左键
#   在同一图层中的两个图形同样拥有上下层关系
#       可以在图形工具的属性栏中的路径排列方式来进行上下层关系的调节

#路径选择工具
#   a
#   用户修改矩形工具等图形的属性和位置
#图层
#   图层缩略图
#       双击可改变对象颜色
#   创建剪贴蒙版
#       可以让下层图层去剪切上层图层
#       上层图层就保留了下层图层的形状
#       却显示上层图层的颜色
#   图层移动
#       上移一层
#           ctrl+]
#       下移一层
#           ctrl+[
#       移至顶层
#           shift+ctrl+]
#       移至低层
#           shift+ctrl+[
#   图层组管理
#       选中需要管理的图层 --> ctrl+g
#   删除组管理
#       选中需要删除的组 --> shift+ctrl+g
#   图层链接
#       选中需要链接的图层 --> 点击链接按钮
#   删除图层链接
#       选中任一被链接的图层 --> 点击链接按钮
#   图层属性
#       不透明度
#       填充
#       锁定全部
#           点击之后就不能改变图层图像的大小位置颜色透明度等，甚至不能删除
#   混合模式
#       说明：上一层图层和下一层图层的混合关系
#       叠加：上下图层颜色相加
#新建图层
#   弹出图层属性窗口添加
#       ctrl+shift+n
#   不弹出图层属性窗口添加
#       ctrl+alt+shift+n
#图层样式
#   进入方式
#       方法一：双击图层空白处
#       方法二：右击图层
#           点击混合选项
#       方法三：选中一个图层
#           点击fx
#               点击混合选项
#   混合选项
#       颜色叠加
#           说明：在原图像上层叠加一个颜色，可设置此颜色的透明度
#           注意：需要点击颜色叠加四个文字才能出现色卡
#       渐变叠加
#           说明：在原图像上层叠加一个渐变色，可设置此的渐变色的多个属性
#       图案叠加
#           说明：在原图像上层叠加一个图案
#           曾多新图案
#               点击图像拾色器
#                   点击轮按钮
#                       艺术表面到web图案都可以点选或追加
#           设置图案属性
#               缩放
#                   说明：调图案大小
#       投影
#           概念：在图形下添加阴影
#           投影的位置操作
#               拖拽画布调整投影
#                   注意：不关闭投影样式卡的情况
#               调整选项卡中的属性
#                   颜色
#                   透明度
#                   角度
#                       全局光
#                           当在同一个画布中有两个投影时，选中全局光后，可以同时调节两个投影的光源角度，反之调节一个投影角度
#                   距离
#                   扩展
#                   大小：羽化值
#       描边
#           颜色
#           宽度
#       内阴影
#           概念：在图形中添加阴影
#           混合模式：正常
#           角度
#           距离
#           阻塞
#           大小
#               羽化大小
#       内发光
#           概念：在图形内发光
#       外发光
#           概念：在图形外发光
#       斜面和浮雕
#
#画笔工具
#   b
#   定义画笔预设
#       新建画布，输入需要的符号
#       alt+e+b
#       修改名字点击确定
#   属性
#       画笔预设拾取器
#           图案大小
#       切换画笔设置
#           F5
#               画笔笔尖形态
#                   画笔大小
#                   画笔的间隙程度
#                       说明：长按左键绘制图案时，设定符号之间的距离
#               形状动态
#                   大小抖动
#                       说明：绘制的团有大有小
#                   角度抖动
#                       说明：
#                   圆度抖动
#                       说明：圆润程度
#               散步
#                   散步
#                       说明：分布情况
#                   数量
#                       说明：图形数量
#图形工具与选取工具的相同与不同
#   选区工具+填充
#       使用移动工具操作
#           v
#           说明
#               复制图形会在新建图层中复制，移动工具中的对齐方式需要选中全部图层后进行操作
#               添加渐变颜色通过渐变工具
#   图形工具
#       使用路径选取工具操作
#           a
#           说明
#               复制图形会在同一图层中复制，路径选取工具中的对齐方式需要选中全部图形路径后进行操作
#               添加渐变颜色通过双击图形所在图层的空白处，打开图层样式添加渐变叠加效果
#艺术字体
#   二牛童童
#       字体：方正胖娃字体
#       操作步骤：文字工具输入文字，文字变形为扇形，修改弯曲弧度，字体添加了渐变色，复制一个新图层，将原来的图层上移动，改变新的图层文字，将两个图层合并组，给这个组添加描边的图层样式
#   倚天屠龙记
#       字体：华文行楷
#照片
#   矩形圆角
#       操作步骤：矩形选区工具选定完整照片，平滑10度（alt+s+m+s）,反选选区，删除选区
#   修改选区（扩展或收缩）
#       操作步骤：按住ctrl+左键点击照片图层的缩略图，则全选该照片图形，即可修改选区大小
#只给拥有多个图层效果的图层添加斜切投影
#   步骤
#       新建一个空图层
#       与之前的图层进行合并
#           说明：一合并，图层中的图层样式提示就没有了但是效果还在
#       再给新的图层添加投影样式
#           右键点击fx
#               创建图层
#                   说明：此步骤的意思就是将fx代表的图层样式进行新建图层，与之前的文字进行分离
#围绕圆形的圆形
#   步骤
#       首先绘制一个在中垂线上圆形，
#       ctrl+alt+t，将小圆的中心点移到大圆的圆心
#       设置角度为24度（365/15）
#       ctrl+alt+shift+t，复制上一部步骤
#       用小黑选中第二个和第三个小圆
#       ctrl+alt+t，将中心点移到大圆的圆心
#       水平反转
#照片去灰
#   步骤
#       调出色阶
#           快捷键
#               alt+i+j+l
#               ctlr+l
#